/******************************************************
* GameScene.h		ゲームシーン管理
* 制作者：ミヤタジョウジ
* 作成日：2024/10/22
* 最終更新日：2024/10/22
*******************************************************/
#include "framework.h"
#include "DirectX/DirectX.h"
#include "Game/GameScene.h"

/****************************************************
* ゲームシーン初期化
*****************************************************/
GameScene::GameScene() {
	m_camera = new Camera();
	m_phaseNum = 0;
	m_phase = new Phase(0.0f, 9.8f);
}

/****************************************************
* ゲームシーン更新
*****************************************************/
void GameScene::Update() {
	m_phase->Update();
	m_camera->Update();
}

/****************************************************
* ゲームシーン描画
*****************************************************/
void GameScene::Draw() {
	m_camera->Draw();
	m_phase->Draw();
}

/****************************************************
* ゲームシーン終了
*****************************************************/
GameScene::~GameScene() {
	if (m_phase) delete m_phase;
	if (m_camera) delete m_camera;
}

/****************************************************
* フェーズチェンジ
*****************************************************/
void GameScene::ChangePhase() {

}
