/******************************************************
* Ground.cpp	地面
* 制作者：ミヤタジョウジ
* 作成日：2024/11/07
* 最終更新日：2024/11/07
*******************************************************/
#include "framework.h"
#include "DirectX/DirectX.h"
#include "Game/Physics.h"

#include "Game/Ground.h"

/****************************************************
* 地面初期化
*****************************************************/
Ground::Ground(XMFLOAT2 pos, float rot, XMFLOAT2 size, int uvNum) : FieldObject(pos, rot, size, uvNum) {

	SetTag("Ground");
}

/****************************************************
* 地面終了
*****************************************************/
Ground::~Ground() {

}

/****************************************************
* 地面更新
*****************************************************/
void Ground::Update() {

}

/****************************************************
* 地面描画
*****************************************************/
void Ground::Draw() {
	D3D.Draw2D(m_tex, m_pos, XMFLOAT2(m_size.x * 1.5f, m_size.y * 1.5f), 0.0f, m_uv, m_texSize);
}


